app/controllers/projects_controller.rb

SELECT `projects`.* FROM `projects`
---
  def index
    p params,"================================"
    p params[:subdomain]
    @projects = Project.all

SELECT `projects`.* FROM `projects` WHERE `projects`.`id` = 1 LIMIT 1
---
  def show
    @project = Project.find(params[:id])

INSERT INTO `projects` (`updated_at`, `created_at`, `user_id`, `description`, `name`) VALUES ('2011-06-29 05:39:56', '2011-06-29 05:39:56', NULL, 'test', 'First Project')
---
  def create
    @project = Project.new(params[:project])

    respond_to do |format|
      if @project.save